wisteria-1c/Конфигурация/DataProcessors/БонусныеПрограммы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>БонусныеПрограммы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВариантыСовместногоПримененияСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыСовместногоПримененияСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вытеснение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минимум</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Максимум</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Умножение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/СпособыПредоставленияСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыПредоставленияСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВидЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоБонусныхБаллов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Округление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подарок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Промокод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентОтСуммыВВидеБонусныхБаллов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расширение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучнаяСкидка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/DataProcessors/БонусныеПрограммы/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВариантСовместногоПрименения = Константы.ВариантыСовместногоПримененияСкидокНаценок.Получить();
	Если ВариантСовместногоПрименения.Пустая() Тогда
		ВариантСовместногоПрименения = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Максимум;
		Константы.ВариантыСовместногоПримененияСкидокНаценок.Установить(ВариантСовместногоПрименения);
	КонецЕсли;
	
	// Открытие из вида дисконтных карт для настройки бонусов по ДК
	БонуснаяПрограмма = Неопределено;
	ОткрытиеБонусов = Неопределено;
	ВидДК = Неопределено;
	Округления = Неопределено;
	АвтоматическиеСкидки = Неопределено;
	Если Параметры.Свойство("БонуснаяПрограмма", БонуснаяПрограмма) И ЗначениеЗаполнено(БонуснаяПрограмма) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(БонусныеПрограммыИСкидки,
			"БонуснаяПрограмма", БонуснаяПрограмма,,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(АвтоматическиеОкругления,
			"БонуснаяПрограмма", БонуснаяПрограмма,,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
		Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаБонусныеПрограммы.Видимость = Ложь;
		Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаНачисленияИСписания.Видимость = Ложь;
		Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаРучныеСкидки.Видимость = Ложь;
		ВидимостьОкруглений = Ложь;
		ПоказыватьОкругления = Неопределено;
		Если Параметры.Свойство("ПоказыватьОкругления", ПоказыватьОкругления) И ПоказыватьОкругления = Истина Тогда
			ВидимостьОкруглений = Истина;
		КонецЕсли;
		Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаАвтоматическоеОкругление.Видимость = ВидимостьОкруглений;		
		Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаПравилаНачисления.Видимость = НЕ ВидимостьОкруглений;
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	ИначеЕсли Параметры.Свойство("ОткрытиеБонусов", ОткрытиеБонусов) И ОткрытиеБонусов = Истина Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаБонусныеПрограммы;
	ИначеЕсли Параметры.Свойство("ВидДК", ВидДК) И ЗначениеЗаполнено(ВидДК) Тогда
		ВидыДКУсловия = Новый Массив();
		ВидыДКУсловия.Добавить(ВидДК);
		ВидыДКУсловия.Добавить(Справочники.ВидыДисконтныхКарт.ПустаяСсылка());
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(БонусныеПрограммыИСкидки,
			"ВидДК", ВидыДКУсловия,ВидСравненияКомпоновкиДанных.ВСписке,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
		Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаБонусныеПрограммы.Видимость = Ложь;
		Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаНачисленияИСписания.Видимость = Ложь;
		Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаАвтоматическоеОкругление.Видимость = Ложь;
		Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаРучныеСкидки.Видимость = Ложь;
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	ИначеЕсли Параметры.Свойство("Округления", Округления) И Округления Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаАвтоматическоеОкругление;
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	ИначеЕсли Параметры.Свойство("АвтоматическиеСкидки", АвтоматическиеСкидки) И АвтоматическиеСкидки Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПравилаНачисления;
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
	// Установка доступности цен для редактирования.
	РазрешеноРедактированиеЦенДокументов = УправлениеДоступомУНФ.РазрешеноРедактированиеЦенДокументов();
	Элементы.ВариантСовместногоПрименения.ТолькоПросмотр = НЕ РазрешеноРедактированиеЦенДокументов;

	// АвтоматическиеСкидки
	ИспользоватьАвтоматическиеСкидкиНаценки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки");
	ИспользоватьБонусы = ПолучитьФункциональнуюОпцию("ИспользоватьБонусныеПрограммы");
	ЗаголовокСкидкиИБонусы = "";
	Если ИспользоватьАвтоматическиеСкидкиНаценки И ИспользоватьБонусы Тогда
		ЗаголовокСкидкиИБонусы = НСтр("ru = 'Автоматические скидки и бонусы'");
	ИначеЕсли ИспользоватьАвтоматическиеСкидкиНаценки Тогда
		ЗаголовокСкидкиИБонусы = НСтр("ru = 'Автоматические скидки'");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(БонусныеПрограммыИСкидки,
			"ЭтоПравилоНачисленияБонусов", Ложь, ВидСравненияКомпоновкиДанных.Равно);		
	ИначеЕсли ИспользоватьАвтоматическиеСкидкиНаценки Тогда
		ЗаголовокСкидкиИБонусы = НСтр("ru = 'Правила начисления бонусов'");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(БонусныеПрограммыИСкидки,
			"ЭтоПравилоНачисленияБонусов", Истина, ВидСравненияКомпоновкиДанных.Равно);		
	Иначе
		Элементы.ГруппаПравилаНачисления.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаПравилаНачисления.Заголовок = ЗаголовокСкидкиИБонусы;
	Если ИспользоватьАвтоматическиеСкидкиНаценки ИЛИ ИспользоватьБонусы Тогда
		Вытеснение = ПредопределенноеЗначение("Перечисление.ВариантыСовместногоПримененияСкидокНаценок.Вытеснение");
		Умножение = ПредопределенноеЗначение("Перечисление.ВариантыСовместногоПримененияСкидокНаценок.Умножение");
		
		ВариантСовместногоПримененияСкидок = Константы.ВариантыСовместногоПримененияСкидокНаценок.Получить();
		Если ВариантСовместногоПримененияСкидок.Пустая() Тогда
			Если РазрешеноРедактированиеЦенДокументов Тогда
				ВариантСовместногоПримененияСкидок = Перечисления.ВариантыСовместногоПримененияСкидокНаценок.Сложение;
				УстановитьПривилегированныйРежим(Истина);
				Константы.ВариантыСовместногоПримененияСкидокНаценок.Установить(ВариантСовместногоПримененияСкидок);
				УстановитьПривилегированныйРежим(Ложь);
			Иначе
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю(НСтр(
					"ru = 'Автоматические скидки не настроены. Обратитесь к пользователю с правом редактирования цен в документах.'"));
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ВариантСовместногоПримененияСкидок = Вытеснение
		ИЛИ ВариантСовместногоПримененияСкидок = Умножение Тогда
		УстановитьСортировкуСпискаПоПолюПорядокНаСервере();
	КонецЕсли;
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(НачисленияИСписания);
	
	СформироватьЗаголовокКоманды();
	УстановитьУсловноеОформление();
	// Конец АвтоматическиеСкидки
	
	АдаптацияТакси()

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьОтборНедействительная(БонусныеПрограммыИСкидки, СкидкиСкрыватьНедействительные);
	УстановитьОтборНедействительная(АвтоматическиеОкругления, ОкругленияСкрыватьНедействительные);
	Элементы.БонусныеПрограммыИСкидкиСкрыватьНедействительные.Пометка = СкидкиСкрыватьНедействительные;
	Элементы.АвтоматическиеОкругленияСкрыватьНедействительные.Пометка = ОкругленияСкрыватьНедействительные;	

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении элемента ВариантСовместногоПримененияСкидок.
//
&НаКлиенте
Процедура ВариантСовместногоПримененияБонусовПриИзменении(Элемент)
	
	ВариантСовместногоПримененияБонусовПриИзмененииНаСервере(ВариантСовместногоПрименения);
	Если ВариантСовместногоПрименения = ПредопределенноеЗначение("Перечисление.ВариантыСовместногоПримененияСкидокНаценок.Вытеснение")
		ИЛИ ВариантСовместногоПрименения = ПредопределенноеЗначение("Перечисление.ВариантыСовместногоПримененияСкидокНаценок.Умножение") Тогда
		ПроверитьСортировкуСписка();
	КонецЕсли;
	Элементы.БонусныеПрограммыИСкидки.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаКакРаботатьСОкруглениямиВПрограммеНажатие(Элемент)
	
	АдресЗагрузки = "https://its.1c.ru/db/metod81#content:8191:hdoc";
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(АдресЗагрузки);
		
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБонусныеПрограммыИСкидки
&НаКлиенте
Процедура ПравилаНачисленияБонусовПриИзменении(Элемент)
	
	Элемент.Обновить();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАвтоматическиеОкругления
&НаКлиенте
Процедура АвтоматическиеОкругленияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ЗначенияЗаполнения = Новый Структура("СпособПредоставления, БонуснаяПрограмма", 
		ПредопределенноеЗначение("Перечисление.СпособыПредоставленияСкидокНаценок.Округление"),
		БонуснаяПрограмма);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Справочник.АвтоматическиеСкидки.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьГруппуПравилНачисления(Команда)
	
	ПараметрыДляФормыГруппы = Новый Структура("ЭтоГруппа, ЭтоПравилоНачисленияБонусов", Истина, Истина);
	ОткрытьФорму("Справочник.АвтоматическиеСкидки.ФормаГруппы", ПараметрыДляФормыГруппы,,,,,, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);

КонецПроцедуры

// Процедура - обработчик команды УстановитьФлагДействует формы.
//
&НаКлиенте
Процедура СкидкиУстановитьФлагДействует(Команда)
	
	СтрокиДляОбработки = Элементы.БонусныеПрограммыИСкидки.ПолучитьСтрокиДляОбработки();
	Если ЗначениеЗаполнено(СтрокиДляОбработки) Тогда
		ИзменитьФлагДействуетСервер(Истина, СтрокиДляОбработки);
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик команды СброситьФлагДействует формы.
//
&НаКлиенте
Процедура СкидкиСброситьФлагДействует(Команда)
	
	СтрокиДляОбработки = Элементы.БонусныеПрограммыИСкидки.ПолучитьСтрокиДляОбработки();
	Если ЗначениеЗаполнено(СтрокиДляОбработки) Тогда
		ИзменитьФлагДействуетСервер(Ложь, СтрокиДляОбработки);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды УстановитьФлагДействует формы.
//
&НаКлиенте
Процедура ОкругленияУстановитьФлагДействует(Команда)
	
	СтрокиДляОбработки = Элементы.АвтоматическиеОкругления.ПолучитьСтрокиДляОбработки();
	Если ЗначениеЗаполнено(СтрокиДляОбработки) Тогда
		ИзменитьФлагДействуетСервер(Истина, СтрокиДляОбработки);
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик команды СброситьФлагДействует формы.
//
&НаКлиенте
Процедура ОкругленияСброситьФлагДействует(Команда)
	
	СтрокиДляОбработки = Элементы.АвтоматическиеОкругления.ПолучитьСтрокиДляОбработки();
	Если ЗначениеЗаполнено(СтрокиДляОбработки) Тогда
		ИзменитьФлагДействуетСервер(Ложь, СтрокиДляОбработки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьРучныеСкидки(Команда)
	ВключитьРучныеСкидкиНаСервере();
	Элементы.БонусныеПрограммыИСкидки.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СкидкиСкрыватьНедействительные(Команда)
	
	СкидкиСкрыватьНедействительные = Не СкидкиСкрыватьНедействительные;
	Элементы.БонусныеПрограммыИСкидкиСкрыватьНедействительные.Пометка = СкидкиСкрыватьНедействительные;
	УстановитьОтборНедействительная(БонусныеПрограммыИСкидки, СкидкиСкрыватьНедействительные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкругленияСкрыватьНедействительные(Команда)
	
	ОкругленияСкрыватьНедействительные = Не ОкругленияСкрыватьНедействительные;
	Элементы.БонусныеПрограммыИСкидкиСкрыватьНедействительные.Пометка = ОкругленияСкрыватьНедействительные;
	УстановитьОтборНедействительная(АвтоматическиеОкругления, ОкругленияСкрыватьНедействительные);
	
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыИФункцииОбщегоНазначения

// В процедуре можно установить или сбросить флаг "Действует".
//
// Параметры:
//  НовоеЗначение  - Булево - Новое значение флага "Действует".
//  МассивВыделенныхСтрок  - Массив из Строка - Массив строк, которые выделены в списке автоматических скидок.
//
&НаСервере
Процедура ИзменитьФлагДействуетСервер(НовоеЗначение, Знач МассивВыделенныхСтрок)

	НужноОбновлятьСписок = Ложь;
	Для Каждого СтрокаАвтоСкидок Из МассивВыделенныхСтрок Цикл
		Если СтрокаАвтоСкидок.Действует <> НовоеЗначение Тогда
			Если СтрокаАвтоСкидок.Ссылка.Пустая() Или СтрокаАвтоСкидок.ЭтоГруппа Тогда
				Продолжить;
			КонецЕсли;
			ОбъектАвтоСкидка = СтрокаАвтоСкидок.Ссылка.ПолучитьОбъект();
			ОбъектАвтоСкидка.Действует = НовоеЗначение;
			Попытка
				ОбъектАвтоСкидка.Записать();
				НужноОбновлятьСписок = Истина;
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон(НСтр(
					"ru = 'Не удалось изменить флажок ""Действует"" для автоматической скидки, наценки ""%1"".'"),
					СтрокаАвтоСкидок.Ссылка);
				Сообщение.Поле = "Действует";
				Сообщение.УстановитьДанные(СтрокаАвтоСкидок.Ссылка);
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Если НужноОбновлятьСписок Тогда
		Элементы.БонусныеПрограммыИСкидки.Обновить();
		Элементы.АвтоматическиеОкругления.Обновить();
	КонецЕсли;

КонецПроцедуры // ИзменитьФлагДействуетСервер()
//
// Процедура устанавливает сортировку по полю РеквизитДопУпорядочивания.
//
&НаСервере
Процедура УстановитьСортировкуСпискаПоПолюПорядокНаСервере()
	
	СписокРеквизит = БонусныеПрограммыИСкидки;
	
	ПользовательскиеНастройкиПорядка = Неопределено;
	Для Каждого Элемент Из СписокРеквизит.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПорядокКомпоновкиДанных") Тогда
			ПользовательскиеНастройкиПорядка = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.Проверить(ПользовательскиеНастройкиПорядка <> Неопределено, НСтр(
		"ru = 'Пользовательская настройка порядка не найдена.'"));
	
	ПользовательскиеНастройкиПорядка.Элементы.Очистить();
	Элемент = ПользовательскиеНастройкиПорядка.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	Элемент.Использование = Истина;
	Элемент.Поле = Новый ПолеКомпоновкиДанных("РеквизитДопУпорядочивания");
	Элемент.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// 1. Скидки при возврате (возврат с дисконтом) выделяются красным цветом
	НовоеУсловноеОформление = БонусныеПрограммыИСкидки.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаСтиля.КрасныйТекстСтрок;
	Оформление.Использование 	= Истина;
	
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ИспользоватьПриВозврате");
	Отбор.ПравоеЗначение 	= Истина;
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Действует");
	Отбор.ПравоеЗначение 	= Истина;

	// 2. Заблокированные скидки
	НовоеУсловноеОформление = БонусныеПрограммыИСкидки.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаПалитры.Серый;
	Оформление.Использование 	= Истина;
	
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Действует");
	Отбор.ПравоеЗначение 	= Ложь;

	// 3. Заблокированные Округления
	НовоеУсловноеОформление = АвтоматическиеОкругления.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаПалитры.Серый;
	Оформление.Использование 	= Истина;
	
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Действует");
	Отбор.ПравоеЗначение 	= Ложь;
	
КонецПроцедуры
#КонецОбласти

#Область СортировкаСписка

// Процедура проверяет установленную сортировку по реквизиту "РеквизитДопУпорядочивания" и предлагает
// установить такую сортировку.
//
&НаКлиенте
Процедура ПроверитьСортировкуСписка()
	
	ПараметрыУстановкиСортировки = Новый Структура;
	ПараметрыУстановкиСортировки.Вставить("СписокРеквизит", БонусныеПрограммыИСкидки);
	ПараметрыУстановкиСортировки.Вставить("СписокЭлемент", Элементы.БонусныеПрограммыИСкидки);
	
	Если Не СортировкаВСпискеУстановленаПравильно(БонусныеПрограммыИСкидки) Тогда
		ТекстВопроса = НСтр("ru = 'Сортировку списка рекомендуется установить
								|по полю ""Порядок"". Настроить необходимую сортировку?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьСписокПередОперациейОтветПоСортировкеПолучен", ЭтотОбъект, ПараметрыУстановкиСортировки);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Настроить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Не настраивать'"));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Функция проверяет, что в списке установлена сортировка по реквизиту РеквизитДопУпорядочивания.
//
&НаКлиенте
Функция СортировкаВСпискеУстановленаПравильно(Список)
	
	ПользовательскиеНастройкиПорядка = Неопределено;
	Для Каждого Элемент Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПорядокКомпоновкиДанных") Тогда
			ПользовательскиеНастройкиПорядка = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПользовательскиеНастройкиПорядка = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЭлементыПорядка = ПользовательскиеНастройкиПорядка.Элементы;
	
	// Найдем первый используемый элемент порядка
	Элемент = Неопределено;
	Для Каждого ЭлементПорядка Из ЭлементыПорядка Цикл
		Если ЭлементПорядка.Использование Тогда
			Элемент = ЭлементПорядка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Элемент = Неопределено Тогда
		// Не установлена никакая сортировка
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Элемент) = Тип("ЭлементПорядкаКомпоновкиДанных") Тогда
		Если Элемент.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр Тогда
			ПолеРеквизита = Новый ПолеКомпоновкиДанных("РеквизитДопУпорядочивания");
			Если Элемент.Поле = ПолеРеквизита Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Процедура обрабатывает ответ пользователя на вопрос об установке сортировки по реквизиту РеквизитДопУпорядочивания.
// 
// Параметры:
//  РезультатОтвета - КодВозвратаДиалога - Результат ответа
//  ДополнительныеПараметры - Структура - Дополнительные параметры
&НаКлиенте
Процедура ПроверитьСписокПередОперациейОтветПоСортировкеПолучен(РезультатОтвета, ДополнительныеПараметры) Экспорт
	
	Если РезультатОтвета <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСортировкуСпискаПоПолюПорядок();
	
КонецПроцедуры

// Процедура устанавливает сортировку по полю РеквизитДопУпорядочивания.
//
&НаКлиенте
Процедура УстановитьСортировкуСпискаПоПолюПорядок()
	
	СписокРеквизит = БонусныеПрограммыИСкидки;
	
	ПользовательскиеНастройкиПорядка = Неопределено;
	Для Каждого Элемент Из СписокРеквизит.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПорядокКомпоновкиДанных") Тогда
			ПользовательскиеНастройкиПорядка = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.Проверить(ПользовательскиеНастройкиПорядка <> Неопределено, НСтр("ru = 'Пользовательская настройка порядка не найдена.'"));
	
	ПользовательскиеНастройкиПорядка.Элементы.Очистить();
	Элемент = ПользовательскиеНастройкиПорядка.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	Элемент.Использование = Истина;
	Элемент.Поле = Новый ПолеКомпоновкиДанных("РеквизитДопУпорядочивания");
	Элемент.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантСовместногоПримененияВыбор(ВыбранныйСпособ, ДополнительныеПараметры) Экспорт
 	Если ЗначениеЗаполнено(ВыбранныйСпособ) Тогда
		ВариантСовместногоПрименения = ВыбранныйСпособ;
		ВариантСовместногоПримененияБонусовПриИзменении(Элементы.ВариантСовместногоПрименения);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Интерфейс85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ИнтерфейсТакси = Не Интерфейс85;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БонусныеПрограммыИСкидкиИзменитьФорму", "Видимость", ИнтерфейсТакси);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БонусныеПрограммыИСкидкиСправка", "Видимость", ИнтерфейсТакси);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаИзменитьФорму", "Видимость", Интерфейс85);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСправка", "Видимость", Интерфейс85);
	
КонецПроцедуры

#КонецОбласти

// Процедура - обработчик события ПриИзменении элемента ВариантСовместногоПримененияСкидок (серверная часть).
//
&НаСервереБезКонтекста
Процедура ВариантСовместногоПримененияБонусовПриИзмененииНаСервере(ВариантСовместногоПримененияСкидок)
	
	Константы.ВариантыСовместногоПримененияСкидокНаценок.Установить(ВариантСовместногоПримененияСкидок);
	
КонецПроцедуры
&НаСервере
Процедура ВключитьРучныеСкидкиНаСервере()
	
	СтруктураНастройкиСкидки = Справочники.АвтоматическиеСкидки.ВернутьНастройкиРучнойСкидки();
	
	Если СтруктураНастройкиСкидки.СсылкаАвтоматическойСкидки.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить("Справочник.АвтоматическиеСкидки");
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		РучнаяСкидкаОбъект = СтруктураНастройкиСкидки.СсылкаАвтоматическойСкидки.ПолучитьОбъект();
		РучнаяСкидкаОбъект.Действует = НЕ РучнаяСкидкаОбъект.Действует;
		РучнаяСкидкаОбъект.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Запись автоматических скидок'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.АвтоматическиеСкидки, , ТекстОшибки);
		СообщениеОшибки = ОбработкаОшибок.СообщениеОбОшибкеДляПользователя(ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(СообщениеОшибки);
	КонецПопытки;
	СформироватьЗаголовокКоманды();
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовокКоманды()
	НастройкиРучнойСкидки = Справочники.АвтоматическиеСкидки.ВернутьНастройкиРучнойСкидки();
	Элементы.БонусныеПрограммыИСкидкиВключитьРучныеСкидки.Пометка = НастройкиРучнойСкидки.РучнаяСкидкаДействует;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборНедействительная(Список, Использование)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Действует",
		Истина,
		,
		,
		Использование);
	
КонецПроцедуры
#КонецОбласти
